avrdudes/avr-libc/include/avr/ioavr16du32.h
/* USB.INTFLAGSB  bit masks and bit positions */
/* USB_SETUP  is already defined. */
/* USB_GNDONE  is already defined. */
#define USB_RMWBUSY_bm  0x04  /* RMW Busy Flag bit mask. */
#define USB_RMWBUSY_bp  2  /* RMW Busy Flag bit position. */
/* USB_TRNCOMPL  is already defined. */


/* USB.STATUS  bit masks and bit positions */
#define USB_TOGGLE_bm  0x01  /* Data Toggle bit mask. */
#define USB_TOGGLE_bp  0  /* Data Toggle bit position. */
#define USB_BUSNAK_bm  0x02  /* Data Buffer NAK bit mask. */
#define USB_BUSNAK_bp  1  /* Data Buffer NAK bit position. */
/* USB_STALLED  is already defined. */
#define USB_EPSETUP_bm  0x10  /* EP Setup Complete bit mask. */
#define USB_EPSETUP_bp  4  /* EP Setup Complete bit position. */
/* USB_TRNCOMPL  is already defined. */
#define USB_UNFOVF_bm  0x40  /* Underflow/Overflow EP bit mask. */
#define USB_UNFOVF_bp  6  /* Underflow/Overflow EP bit position. */
#define USB_CRC_bm  0x80  /* CRC Error bit mask. */
#define USB_CRC_bp  7  /* CRC Error bit position. */

/* USB.CTRL  bit masks and bit positions */
#define USB_BUFSIZE_DEFAULT_gm  0x03  /* Data Size default group mask. */
#define USB_BUFSIZE_DEFAULT_gp  0  /* Data Size default group position. */
#define USB_BUFSIZE_DEFAULT_0_bm  (1<<0)  /* Data Size default bit 0 mask. */
#define USB_BUFSIZE_DEFAULT_0_bp  0  /* Data Size default bit 0 position. */
#define USB_BUFSIZE_DEFAULT_1_bm  (1<<1)  /* Data Size default bit 1 mask. */
#define USB_BUFSIZE_DEFAULT_1_bp  1  /* Data Size default bit 1 position. */
#define USB_DOSTALL_bm  0x04  /* Endpoint will respond with STALL bit mask. */
#define USB_DOSTALL_bp  2  /* Endpoint will respond with STALL bit position. */
#define USB_BUFSIZE_ISO_gm  0x07  /* Data Size isochronous group mask. */
#define USB_BUFSIZE_ISO_gp  0  /* Data Size isochronous group position. */
#define USB_BUFSIZE_ISO_0_bm  (1<<0)  /* Data Size isochronous bit 0 mask. */
#define USB_BUFSIZE_ISO_0_bp  0  /* Data Size isochronous bit 0 position. */
#define USB_BUFSIZE_ISO_1_bm  (1<<1)  /* Data Size isochronous bit 1 mask. */
#define USB_BUFSIZE_ISO_1_bp  1  /* Data Size isochronous bit 1 position. */
#define USB_BUFSIZE_ISO_2_bm  (1<<2)  /* Data Size isochronous bit 2 mask. */
#define USB_BUFSIZE_ISO_2_bp  2  /* Data Size isochronous bit 2 position. */
#define USB_TCDSBL_bm  0x08  /* TRNCOMPL Interrupt Disable bit mask. */
#define USB_TCDSBL_bp  3  /* TRNCOMPL Interrupt Disable bit position. */
#define USB_AZLP_bm  0x10  /* Automatic zero length packet bit mask. */
#define USB_AZLP_bp  4  /* Automatic zero length packet bit position. */
#define USB_MULTIPKT_bm  0x20  /* Multipacket transfer enable bit mask. */
#define USB_MULTIPKT_bp  5  /* Multipacket transfer enable bit position. */
#define USB_TYPE_gm  0xC0  /* Endpoint type group mask. */
#define USB_TYPE_gp  6  /* Endpoint type group position. */
#define USB_TYPE_0_bm  (1<<6)  /* Endpoint type bit 0 mask. */
#define USB_TYPE_0_bp  6  /* Endpoint type bit 0 position. */
#define USB_TYPE_1_bm  (1<<7)  /* Endpoint type bit 1 mask. */
#define USB_TYPE_1_bp  7  /* Endpoint type bit 1 position. */

/* USB.CNT  bit masks and bit positions */
#define USB_CNT_gm  0xFFFF  /* Endpoint Byte Count group mask. */
#define USB_CNT_gp  0  /* Endpoint Byte Count group position. */
#define USB_CNT_0_bm  (1<<0)  /* Endpoint Byte Count bit 0 mask. */
#define USB_CNT_0_bp  0  /* Endpoint Byte Count bit 0 position. */
#define USB_CNT_1_bm  (1<<1)  /* Endpoint Byte Count bit 1 mask. */
#define USB_CNT_1_bp  1  /* Endpoint Byte Count bit 1 position. */
#define USB_CNT_2_bm  (1<<2)  /* Endpoint Byte Count bit 2 mask. */
#define USB_CNT_2_bp  2  /* Endpoint Byte Count bit 2 position. */
#define USB_CNT_3_bm  (1<<3)  /* Endpoint Byte Count bit 3 mask. */
#define USB_CNT_3_bp  3  /* Endpoint Byte Count bit 3 position. */
#define USB_CNT_4_bm  (1<<4)  /* Endpoint Byte Count bit 4 mask. */
#define USB_CNT_4_bp  4  /* Endpoint Byte Count bit 4 position. */
#define USB_CNT_5_bm  (1<<5)  /* Endpoint Byte Count bit 5 mask. */
#define USB_CNT_5_bp  5  /* Endpoint Byte Count bit 5 position. */
#define USB_CNT_6_bm  (1<<6)  /* Endpoint Byte Count bit 6 mask. */
#define USB_CNT_6_bp  6  /* Endpoint Byte Count bit 6 position. */
#define USB_CNT_7_bm  (1<<7)  /* Endpoint Byte Count bit 7 mask. */
#define USB_CNT_7_bp  7  /* Endpoint Byte Count bit 7 position. */
#define USB_CNT_8_bm  (1<<8)  /* Endpoint Byte Count bit 8 mask. */
#define USB_CNT_8_bp  8  /* Endpoint Byte Count bit 8 position. */
#define USB_CNT_9_bm  (1<<9)  /* Endpoint Byte Count bit 9 mask. */
#define USB_CNT_9_bp  9  /* Endpoint Byte Count bit 9 position. */
#define USB_CNT_10_bm  (1<<10)  /* Endpoint Byte Count bit 10 mask. */
#define USB_CNT_10_bp  10  /* Endpoint Byte Count bit 10 position. */
#define USB_CNT_11_bm  (1<<11)  /* Endpoint Byte Count bit 11 mask. */
#define USB_CNT_11_bp  11  /* Endpoint Byte Count bit 11 position. */
#define USB_CNT_12_bm  (1<<12)  /* Endpoint Byte Count bit 12 mask. */
#define USB_CNT_12_bp  12  /* Endpoint Byte Count bit 12 position. */
#define USB_CNT_13_bm  (1<<13)  /* Endpoint Byte Count bit 13 mask. */
#define USB_CNT_13_bp  13  /* Endpoint Byte Count bit 13 position. */
#define USB_CNT_14_bm  (1<<14)  /* Endpoint Byte Count bit 14 mask. */
#define USB_CNT_14_bp  14  /* Endpoint Byte Count bit 14 position. */
#define USB_CNT_15_bm  (1<<15)  /* Endpoint Byte Count bit 15 mask. */
#define USB_CNT_15_bp  15  /* Endpoint Byte Count bit 15 position. */

/* USB.DATAPTR  bit masks and bit positions */
#define USB_DATAPTR_gm  0xFFFF  /* Endpoint data pointer group mask. */
#define USB_DATAPTR_gp  0  /* Endpoint data pointer group position. */
#define USB_DATAPTR_0_bm  (1<<0)  /* Endpoint data pointer bit 0 mask. */
#define USB_DATAPTR_0_bp  0  /* Endpoint data pointer bit 0 position. */
#define USB_DATAPTR_1_bm  (1<<1)  /* Endpoint data pointer bit 1 mask. */
#define USB_DATAPTR_1_bp  1  /* Endpoint data pointer bit 1 position. */
#define USB_DATAPTR_2_bm  (1<<2)  /* Endpoint data pointer bit 2 mask. */
#define USB_DATAPTR_2_bp  2  /* Endpoint data pointer bit 2 position. */
#define USB_DATAPTR_3_bm  (1<<3)  /* Endpoint data pointer bit 3 mask. */
#define USB_DATAPTR_3_bp  3  /* Endpoint data pointer bit 3 position. */
#define USB_DATAPTR_4_bm  (1<<4)  /* Endpoint data pointer bit 4 mask. */
#define USB_DATAPTR_4_bp  4  /* Endpoint data pointer bit 4 position. */
#define USB_DATAPTR_5_bm  (1<<5)  /* Endpoint data pointer bit 5 mask. */
#define USB_DATAPTR_5_bp  5  /* Endpoint data pointer bit 5 position. */
#define USB_DATAPTR_6_bm  (1<<6)  /* Endpoint data pointer bit 6 mask. */
#define USB_DATAPTR_6_bp  6  /* Endpoint data pointer bit 6 position. */
#define USB_DATAPTR_7_bm  (1<<7)  /* Endpoint data pointer bit 7 mask. */
#define USB_DATAPTR_7_bp  7  /* Endpoint data pointer bit 7 position. */
#define USB_DATAPTR_8_bm  (1<<8)  /* Endpoint data pointer bit 8 mask. */
#define USB_DATAPTR_8_bp  8  /* Endpoint data pointer bit 8 position. */
#define USB_DATAPTR_9_bm  (1<<9)  /* Endpoint data pointer bit 9 mask. */
#define USB_DATAPTR_9_bp  9  /* Endpoint data pointer bit 9 position. */
#define USB_DATAPTR_10_bm  (1<<10)  /* Endpoint data pointer bit 10 mask. */
#define USB_DATAPTR_10_bp  10  /* Endpoint data pointer bit 10 position. */
#define USB_DATAPTR_11_bm  (1<<11)  /* Endpoint data pointer bit 11 mask. */
#define USB_DATAPTR_11_bp  11  /* Endpoint data pointer bit 11 position. */
#define USB_DATAPTR_12_bm  (1<<12)  /* Endpoint data pointer bit 12 mask. */
#define USB_DATAPTR_12_bp  12  /* Endpoint data pointer bit 12 position. */
#define USB_DATAPTR_13_bm  (1<<13)  /* Endpoint data pointer bit 13 mask. */
#define USB_DATAPTR_13_bp  13  /* Endpoint data pointer bit 13 position. */
#define USB_DATAPTR_14_bm  (1<<14)  /* Endpoint data pointer bit 14 mask. */
#define USB_DATAPTR_14_bp  14  /* Endpoint data pointer bit 14 position. */
#define USB_DATAPTR_15_bm  (1<<15)  /* Endpoint data pointer bit 15 mask. */
#define USB_DATAPTR_15_bp  15  /* Endpoint data pointer bit 15 position. */

/* USB.MCNT  bit masks and bit positions */
#define USB_MCNT_gm  0xFFFF  /* Multi-packet byte count group mask. */
#define USB_MCNT_gp  0  /* Multi-packet byte count group position. */
#define USB_MCNT_0_bm  (1<<0)  /* Multi-packet byte count bit 0 mask. */
#define USB_MCNT_0_bp  0  /* Multi-packet byte count bit 0 position. */
#define USB_MCNT_1_bm  (1<<1)  /* Multi-packet byte count bit 1 mask. */
#define USB_MCNT_1_bp  1  /* Multi-packet byte count bit 1 position. */
#define USB_MCNT_2_bm  (1<<2)  /* Multi-packet byte count bit 2 mask. */
#define USB_MCNT_2_bp  2  /* Multi-packet byte count bit 2 position. */
#define USB_MCNT_3_bm  (1<<3)  /* Multi-packet byte count bit 3 mask. */
#define USB_MCNT_3_bp  3  /* Multi-packet byte count bit 3 position. */
#define USB_MCNT_4_bm  (1<<4)  /* Multi-packet byte count bit 4 mask. */
#define USB_MCNT_4_bp  4  /* Multi-packet byte count bit 4 position. */
#define USB_MCNT_5_bm  (1<<5)  /* Multi-packet byte count bit 5 mask. */
#define USB_MCNT_5_bp  5  /* Multi-packet byte count bit 5 position. */
#define USB_MCNT_6_bm  (1<<6)  /* Multi-packet byte count bit 6 mask. */
#define USB_MCNT_6_bp  6  /* Multi-packet byte count bit 6 position. */
#define USB_MCNT_7_bm  (1<<7)  /* Multi-packet byte count bit 7 mask. */
#define USB_MCNT_7_bp  7  /* Multi-packet byte count bit 7 position. */
#define USB_MCNT_8_bm  (1<<8)  /* Multi-packet byte count bit 8 mask. */
#define USB_MCNT_8_bp  8  /* Multi-packet byte count bit 8 position. */
#define USB_MCNT_9_bm  (1<<9)  /* Multi-packet byte count bit 9 mask. */
#define USB_MCNT_9_bp  9  /* Multi-packet byte count bit 9 position. */
#define USB_MCNT_10_bm  (1<<10)  /* Multi-packet byte count bit 10 mask. */
#define USB_MCNT_10_bp  10  /* Multi-packet byte count bit 10 position. */
#define USB_MCNT_11_bm  (1<<11)  /* Multi-packet byte count bit 11 mask. */
#define USB_MCNT_11_bp  11  /* Multi-packet byte count bit 11 position. */
#define USB_MCNT_12_bm  (1<<12)  /* Multi-packet byte count bit 12 mask. */
#define USB_MCNT_12_bp  12  /* Multi-packet byte count bit 12 position. */
#define USB_MCNT_13_bm  (1<<13)  /* Multi-packet byte count bit 13 mask. */
#define USB_MCNT_13_bp  13  /* Multi-packet byte count bit 13 position. */
#define USB_MCNT_14_bm  (1<<14)  /* Multi-packet byte count bit 14 mask. */
#define USB_MCNT_14_bp  14  /* Multi-packet byte count bit 14 position. */
#define USB_MCNT_15_bm  (1<<15)  /* Multi-packet byte count bit 15 mask. */
#define USB_MCNT_15_bp  15  /* Multi-packet byte count bit 15 position. */



